IDEA Open Model
ConnectionData.FoldedPlates Property
Compatible with IDEA StatiCa v 10.1
 Folded plate of the connection
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public List<FoldedPlateData> FoldedPlates { get; set; }
Public Property FoldedPlates As List(Of FoldedPlateData)
	Get
	Set
public:
property List<FoldedPlateData^>^ FoldedPlates {
	List<FoldedPlateData^>^ get ();
	void set (List<FoldedPlateData^>^ value);
}
Property Value
Type: List<FoldedPlateData>
See Also
Reference
ConnectionData Class
IdeaRS.OpenModel.Connection Namespace